[
  {
    "id": 1,
    "name": "Adam (Adam) - AS",
    "era": "The First Man & Prophet",
    "bio": "Adam (AS) was the first human being, created by Allah from clay. He lived in the garden of Jannah with his wife, Hawwa (Eve), before being sent to Earth as the first Prophet and custodian of the planet.",
    "events": [
      "Creation from clay and the prostration of the angels.",
      "Temptation by Iblis (Satan) and eating from the forbidden tree.",
      "Sincere repentance to Allah and being sent to Earth."
    ],
    "verses": [
      "Qur'an 2:30-37",
      "Qur'an 7:19-25"
    ],
    "lessons": "The nature of repentance, the importance of forgiveness, and humanity's role as stewards (Khalifa) of the Earth.",
    "youtubeId": "xxnZuAHCAjY"
  },
  {
    "id": 2,
    "name": "Nuh (Noah) - AS",
    "era": "Early Prophets",
    "bio": "Nuh (AS) was a Prophet sent to his people after they had fallen into idolatry. He preached the message of Tawhid (the Oneness of Allah) for 950 years with incredible patience, but only a few believed in his message.",
    "events": [
      "Preaching the message of Tawhid for 950 years.",
      "Building the great Ark under the direct command of Allah.",
      "The Great Flood that saved the believers and cleansed the Earth of disbelief."
    ],
    "verses": [
      "Qur'an 71:1-28 (The entire Surah Nuh)",
      "Qur'an 11:25-49"
    ],
    "lessons": "Unwavering patience and perseverance in the face of hardship, and absolute trust in Allah's plan and timing.",
    "youtubeId": "d2D6WuKlymM"
  },
  {
    "id": 3,
    "name": "Ibrahim (Abraham) - AS",
    "era": "The Age of Ibrahim",
    "bio": "Known as 'Khalil-ullah' (the Friend of Allah), Ibrahim (AS) is one of the most revered Prophets. He stood firm against the idolatry of his people, his father, and the tyrant king Nimrod.",
    "events": [
      "Destroying the idols of his people.",
      "Being thrown into a fire which Allah made cool and safe for him.",
      "His willingness to sacrifice his son, Ismail (AS), as a test of faith.",
      "Rebuilding the Kaaba in Makkah with his son Ismail (AS)."
    ],
    "verses": [
      "Qur'an 2:124-130",
      "Qur'an 37:99-113"
    ],
    "lessons": "The meaning of true submission (Islam), courage to stand for the truth alone, and the legacy of Tawhid.",
    "youtubeId": "lEyN2538Wd4"
  },
  {
    "id": 4,
    "name": "Musa (Moses) - AS",
    "era": "The Prophets of Israel",
    "bio": "Musa (AS) was a Prophet sent to the Children of Israel to free them from the tyranny of the Pharaoh of Egypt. He was given the Torah and performed many great miracles by Allah's permission.",
    "events": [
      "His confrontation with Pharaoh and the magicians of Egypt.",
      "The nine great signs (miracles) sent to the people of Pharaoh.",
      "Parting the Red Sea to save the believers and drown the army of Pharaoh.",
      "Receiving the Ten Commandments and the Torah on Mount Tur."
    ],
    "verses": [
      "Qur'an 20:9-98 (Surah Taha)",
      "Qur'an 28:1-43"
    ],
    "lessons": "Courage in the face of tyranny, the power of prayer, and the importance of divine law and guidance.",
    "youtubeId": "afNf270TE18"
  },
  {
    "id": 5,
    "name": "Isa (Jesus) - AS",
    "era": "The Prophets of Israel",
    "bio": "Isa (AS) is the son of Maryam (Mary) and is known as 'the Word of Allah'. He was born miraculously without a father and was sent as a Prophet to the Children of Israel with the message of the Injeel (Gospel).",
    "events": [
      "His miraculous birth and speaking from the cradle to defend his mother's honor.",
      "Performing miracles such as healing the sick and giving life to the dead by Allah's permission.",
      "Being raised to Allah and protected from crucifixion.",
      "His prophesied return to Earth before the Day of Judgment."
    ],
    "verses": [
      "Qur'an 3:45-59",
      "Qur'an 19:16-36"
    ],
    "lessons": "The power of Allah to do the impossible, the virtue of piety and purity, and his role as a sign for humanity.",
    "youtubeId": "91P0hAAR-So"
  },
  {
    "id": 6,
    "name": "Muhammad (ﷺ)",
    "era": "The Final Prophet",
    "bio": "Muhammad (ﷺ) is the final Messenger of Allah, sent to all of humanity. He is known as 'the Seal of the Prophets'. He received the final revelation, the Qur'an, over a period of 23 years.",
    "events": [
      "Receiving the first revelation in the cave of Hira.",
      "The Night Journey (Isra) and Ascension (Mi'raj).",
      "The Hijra (migration) from Makkah to Madinah, establishing the first Muslim community.",
      "The Farewell Pilgrimage and the completion of the message of Islam."
    ],
    "verses": [
      "Qur'an 33:40",
      "Qur'an 21:107"
    ],
    "lessons": "He is the ultimate example of mercy, compassion, leadership, and perfect character for all of humanity.",
    "youtubeId": "DdWxCVYAOCk"
  }
]
