[
  {
    "id": 1,
    "name": "Adam (Adam) - AS",
    "era": "The First Man & Prophet",
    "bio": "Adam (AS) was the first human being, created by Allah from clay. He lived in the garden of Jannah with his wife, Hawwa (Eve), before being sent to Earth as the first Prophet and custodian of the planet.",
    "events": [
      "Creation from clay and the prostration of the angels.",
      "Temptation by Iblis (Satan) and eating from the forbidden tree.",
      "Sincere repentance to Allah and being sent to Earth."
    ],
    "verses": ["Qur'an 2:30-37", "Qur'an 7:19-25"],
    "lessons": "The nature of repentance, the importance of forgiveness, and humanity's role as stewards (Khalifa) of the Earth.",
    "youtubeId": "gIqIXc2_12M"
  },
  {
    "id": 2,
    "name": "Nuh (Noah) - AS",
    "era": "Early Prophets",
    "bio": "Nuh (AS) was sent to his people after they had fallen into idolatry. He preached the Oneness of Allah for 950 years with incredible patience.",
    "events": [
      "Preaching the message of Tawhid for 950 years.",
      "Building the great Ark under Allah's command.",
      "The Great Flood that saved the believers."
    ],
    "verses": ["Qur'an 71:1-28", "Qur'an 11:25-49"],
    "lessons": "Unwavering patience, perseverance, and trust in Allah's plan.",
    "youtubeId": "0s_a_g29nI4"
  },
  {
    "id": 3,
    "name": "Hud (Hud) - AS",
    "era": "The People of 'Ad",
    "bio": "Hud (AS) was sent to the people of 'Ad who were powerful and arrogant. They refused to worship Allah alone.",
    "events": [
      "Preaching Tawhid to the people of 'Ad.",
      "Warning them of Allah’s punishment.",
      "The great wind that destroyed the disbelievers."
    ],
    "verses": ["Qur'an 11:50-60"],
    "lessons": "Humility before Allah and the danger of pride and disobedience.",
    "youtubeId": "ak6PzQTiRJo"
  },
  {
    "id": 4,
    "name": "Salih (Salih) - AS",
    "era": "The People of Thamud",
    "bio": "Salih (AS) was sent to Thamud. He called them to worship Allah alone, but they demanded a miracle.",
    "events": [
      "The miracle of the she-camel sent by Allah.",
      "The people’s rejection and killing of the camel.",
      "Allah’s punishment that destroyed Thamud."
    ],
    "verses": ["Qur'an 7:73-79", "Qur'an 11:61-68"],
    "lessons": "Respect Allah’s signs and never reject truth after clear evidence.",
    "youtubeId": "yX8bcLhm3i8"
  },
  {
    "id": 5,
    "name": "Ibrahim (Abraham) - AS",
    "era": "The Age of Ibrahim",
    "bio": "Ibrahim (AS) stood against idolatry and falsehood. Known as 'Khalilullah' (Friend of Allah).",
    "events": [
      "Destroyed idols of his people.",
      "Thrown into fire which became cool and safe.",
      "Willing to sacrifice his son Ismail.",
      "Rebuilt the Kaaba in Makkah."
    ],
    "verses": ["Qur'an 2:124-130", "Qur'an 37:99-113"],
    "lessons": "True submission to Allah, courage, and legacy of Tawhid.",
    "youtubeId": "zR_8n452-Cg"
  },
  {
    "id": 6,
    "name": "Yusuf (Joseph) - AS",
    "era": "The Prophets of Israel",
    "bio": "Yusuf (AS) was known for his beauty, patience, and wisdom. His life is a story of betrayal, patience, and victory.",
    "events": [
      "Thrown into a well by his brothers.",
      "Sold into slavery and falsely imprisoned.",
      "Became a leader in Egypt through Allah’s mercy."
    ],
    "verses": ["Qur'an 12:1-111"],
    "lessons": "Patience through hardship and forgiveness of others.",
    "youtubeId": "LZpT0Zxx4FY"
  },
  {
    "id": 7,
    "name": "Musa (Moses) - AS",
    "era": "The Prophets of Israel",
    "bio": "Musa (AS) freed the Children of Israel from Pharaoh’s tyranny. He was given the Torah and performed many miracles.",
    "events": [
      "Confronted Pharaoh and his magicians.",
      "Parted the Red Sea by Allah’s permission.",
      "Received the Ten Commandments on Mount Tur."
    ],
    "verses": ["Qur'an 20:9-98", "Qur'an 28:1-43"],
    "lessons": "Courage against oppression and obedience to Allah.",
    "youtubeId": "CKy0d2-Nk-Q"
  },
  {
    "id": 8,
    "name": "Dawud (David) - AS",
    "era": "The Kingdom of Israel",
    "bio": "Dawud (AS) was both a Prophet and King of Israel. He was blessed with wisdom, strength, and a beautiful voice.",
    "events": [
      "Defeated Jalut (Goliath).",
      "Ruled Israel with justice and fairness.",
      "Received the Zabur (Psalms)."
    ],
    "verses": ["Qur'an 38:17-26"],
    "lessons": "Justice, humility, and using power for good.",
    "youtubeId": "3h9oY8zD3eg"
  },
  {
    "id": 9,
    "name": "Isa (Jesus) - AS",
    "era": "The Prophets of Israel",
    "bio": "Isa (AS) is the son of Maryam, born without a father by Allah’s command. He performed miracles and will return before Judgment Day.",
    "events": [
      "Born miraculously and spoke from the cradle.",
      "Healed the sick and raised the dead by Allah’s permission.",
      "Was raised up by Allah and will return again."
    ],
    "verses": ["Qur'an 3:45-59", "Qur'an 19:16-36"],
    "lessons": "Purity, humility, and belief in Allah’s power.",
    "youtubeId": "0I3x0k62O90"
  },
  {
    "id": 10,
    "name": "Muhammad (ﷺ)",
    "era": "The Final Prophet",
    "bio": "Muhammad (ﷺ) is the final Messenger to all humanity. He received the Qur’an and completed Allah’s message.",
    "events": [
      "First revelation in Cave Hira.",
      "Isra and Mi’raj (Night Journey).",
      "Migration to Madinah and final sermon."
    ],
    "verses": ["Qur'an 33:40", "Qur'an 21:107"],
    "lessons": "Mercy, compassion, and perfect character for mankind.",
    "youtubeId": "g-t0aD0Q-Yg"
  }
    ]
